Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# shortcut.when.caption.browserFocus
source: Only while a browser pane is focused
ar: فقط أثناء تركيز لوحة المتصفح
bs: Samo dok okno preglednika ima fokus
da: Kun mens et browserpanel har fokus
de: Nur solange ein Browser-Pane fokussiert ist
es: Solo mientras un panel del navegador tiene el foco
fr: Uniquement lorsqu'un panneau de navigateur a le focus
it: Solo mentre un riquadro del browser ha il focus
ja: ブラウザペインにフォーカスがあるときのみ
ko: 브라우저 패널에 포커스가 있는 동안에만
nb: Bare mens et nettleserpanel har fokus
pl: Tylko gdy panel przeglądarki ma fokus
pt_br: Somente enquanto um painel do navegador está em foco
ru: Только пока панель браузера в фокусе
th: เฉพาะเมื่อเพนเบราว์เซอร์อยู่ในโฟกัสเท่านั้น
tr: Yalnızca bir tarayıcı bölmesi odaktayken
uk: Лише поки панель браузера у фокусі
zh_hans: 仅当浏览器窗格获得焦点时
zh_hant: 僅在瀏覽器窗格取得焦點時

# shortcut.when.caption.browserOrFilePreviewTextEditorFocus
source: Only while a browser pane or text file preview is focused
ar: فقط أثناء تركيز لوحة المتصفح أو معاينة ملف نصي
bs: Samo dok okno preglednika ili pregled tekstualne datoteke ima fokus
da: Kun mens et browserpanel eller en tekstfilforhåndsvisning har fokus
de: Nur solange ein Browser-Pane oder eine Textdateivorschau fokussiert ist
es: Solo mientras un panel del navegador o una vista previa de archivo de texto tiene el foco
fr: Uniquement lorsqu'un panneau de navigateur ou un aperçu de fichier texte a le focus
it: Solo mentre un riquadro del browser o un'anteprima di file di testo ha il focus
ja: ブラウザペインまたはテキストファイルプレビューにフォーカスがあるときのみ
ko: 브라우저 패널 또는 텍스트 파일 미리보기에 포커스가 있는 동안에만
nb: Bare mens et nettleserpanel eller en tekstfilforhåndsvisning har fokus
pl: Tylko gdy panel przeglądarki lub podgląd pliku tekstowego ma fokus
pt_br: Somente enquanto um painel do navegador ou uma pré-visualização de arquivo de texto está em foco
ru: Только пока панель браузера или предпросмотр текстового файла в фокусе
th: เฉพาะเมื่อเพนเบราว์เซอร์หรือการแสดงตัวอย่างไฟล์ข้อความอยู่ในโฟกัสเท่านั้น
tr: Yalnızca bir tarayıcı bölmesi veya metin dosyası önizlemesi odaktayken
uk: Лише поки панель браузера або попередній перегляд текстового файлу у фокусі
zh_hans: 仅当浏览器窗格或文本文件预览获得焦点时
zh_hant: 僅在瀏覽器窗格或文字檔案預覽取得焦點時

# shortcut.when.caption.filePreviewTextEditorFocus
source: Only while a text file preview is focused
ar: فقط أثناء تركيز معاينة ملف نصي
bs: Samo dok pregled tekstualne datoteke ima fokus
da: Kun mens en tekstfilforhåndsvisning har fokus
de: Nur solange eine Textdateivorschau fokussiert ist
es: Solo mientras una vista previa de archivo de texto tiene el foco
fr: Uniquement lorsqu'un aperçu de fichier texte a le focus
it: Solo mentre un'anteprima di file di testo ha il focus
ja: テキストファイルプレビューにフォーカスがあるときのみ
ko: 텍스트 파일 미리보기에 포커스가 있는 동안에만
nb: Bare mens en tekstfilforhåndsvisning har fokus
pl: Tylko gdy podgląd pliku tekstowego ma fokus
pt_br: Somente enquanto uma pré-visualização de arquivo de texto está em foco
ru: Только пока предпросмотр текстового файла в фокусе
th: เฉพาะเมื่อการแสดงตัวอย่างไฟล์ข้อความอยู่ในโฟกัสเท่านั้น
tr: Yalnızca bir metin dosyası önizlemesi odaktayken
uk: Лише поки попередній перегляд текстового файлу у фокусі
zh_hans: 仅当文本文件预览获得焦点时
zh_hant: 僅在文字檔案預覽取得焦點時

# shortcut.when.caption.markdownFocus
source: Only while a markdown preview is focused
ar: فقط أثناء تركيز معاينة Markdown
bs: Samo dok Markdown pregled ima fokus
da: Kun mens en Markdown-forhåndsvisning har fokus
de: Nur solange eine Markdown-Vorschau fokussiert ist
es: Solo mientras una vista previa de Markdown tiene el foco
fr: Uniquement lorsqu'un aperçu Markdown a le focus
it: Solo mentre un'anteprima Markdown ha il focus
ja: マークダウンプレビューにフォーカスがあるときのみ
ko: 마크다운 미리보기에 포커스가 있는 동안에만
nb: Bare mens en Markdown-forhåndsvisning har fokus
pl: Tylko gdy podgląd Markdown ma fokus
pt_br: Somente enquanto uma pré-visualização de Markdown está em foco
ru: Только пока предпросмотр Markdown в фокусе
th: เฉพาะเมื่อตัวอย่าง Markdown อยู่ในโฟกัสเท่านั้น
tr: Yalnızca bir Markdown önizlemesi odaktayken
uk: Лише поки попередній перегляд Markdown у фокусі
zh_hans: 仅当 Markdown 预览获得焦点时
zh_hant: 僅在 Markdown 預覽取得焦點時

# shortcut.when.caption.override
source: When: %@
ar: الشرط: %@
bs: Kada: %@
da: Når: %@
de: Wenn: %@
es: Cuando: %@
fr: Quand : %@
it: Quando: %@
ja: 条件: %@
ko: 조건: %@
nb: Når: %@
pl: Gdy: %@
pt_br: Quando: %@
ru: Когда: %@
th: เมื่อ: %@
tr: Koşul: %@
uk: Коли: %@
zh_hans: 条件：%@
zh_hant: 條件：%@

# shortcut.when.caption.sidebarFocus
source: Only while the right sidebar is focused
ar: فقط أثناء تركيز الشريط الجانبي الأيمن
bs: Samo dok desna bočna traka ima fokus
da: Kun mens den højre sidebjælke har fokus
de: Nur solange die rechte Seitenleiste fokussiert ist
es: Solo mientras la barra lateral derecha tiene el foco
fr: Uniquement lorsque la barre latérale droite a le focus
it: Solo mentre la barra laterale destra ha il focus
ja: 右サイドバーにフォーカスがあるときのみ
ko: 오른쪽 사이드바에 포커스가 있는 동안에만
nb: Bare mens det høyre sidefeltet har fokus
pl: Tylko gdy prawy pasek boczny ma fokus
pt_br: Somente enquanto a barra lateral direita está em foco
ru: Только пока правая боковая панель в фокусе
th: เฉพาะเมื่อแถบด้านข้างขวาอยู่ในโฟกัสเท่านั้น
tr: Yalnızca sağ kenar çubuğu odaktayken
uk: Лише поки права бічна панель у фокусі
zh_hans: 仅当右侧边栏获得焦点时
zh_hant: 僅在右側邊欄取得焦點時

# shortcut.when.caption.simulatorFocus
source: Only while a Simulator is focused
ar: فقط عندما يكون المحاكي نشطًا
de: Nur wenn ein Simulator fokussiert ist
es: Solo cuando un simulador está enfocado
fr: Uniquement lorsqu’un simulateur a le focus
ja: Simulator にフォーカスがあるときのみ
ko: 시뮬레이터에 포커스가 있을 때만
zh_hans: 仅当模拟器获得焦点时
zh_hant: 僅在模擬器處於焦點時

# shortcut.when.caption.terminalFocus
source: Only while a terminal pane is focused
ar: فقط أثناء تركيز لوحة الطرفية
bs: Samo dok terminalsko okno ima fokus
da: Kun mens et terminalpanel har fokus
de: Nur solange ein Terminal-Pane fokussiert ist
es: Solo mientras un panel de terminal tiene el foco
fr: Uniquement lorsqu'un panneau de terminal a le focus
it: Solo mentre un riquadro del terminale ha il focus
ja: ターミナルペインにフォーカスがあるときのみ
ko: 터미널 패널에 포커스가 있는 동안에만
nb: Bare mens et terminalpanel har fokus
pl: Tylko gdy panel terminala ma fokus
pt_br: Somente enquanto um painel de terminal está em foco
ru: Только пока панель терминала в фокусе
th: เฉพาะเมื่อเพนเทอร์มินัลอยู่ในโฟกัสเท่านั้น
tr: Yalnızca bir terminal bölmesi odaktayken
uk: Лише поки панель термінала у фокусі
zh_hans: 仅当终端窗格获得焦点时
zh_hant: 僅在終端機窗格取得焦點時

# shortcutDiscovery.button.help
source: Show all shortcuts
ar: إظهار كافة الاختصارات
de: Alle Tastenkombinationen anzeigen
es: Mostrar todos los atajos
fr: Afficher tous les raccourcis
ja: すべてのショートカットを表示
ko: 모든 단축키 표시
zh_hans: 显示所有快捷键
zh_hant: 顯示所有快速鍵

# shortcutDiscovery.section.app
source: App
ar: تطبيق
es: Aplicación
fr: Application
ja: アプリ
ko: 앱
zh_hans: 应用
zh_hant: 應用程式

# shortcutDiscovery.section.browser
source: Browser & Find
ar: المتصفح والبحث
de: Browser & Suchen
es: Navegador y búsqueda
fr: Navigateur et recherche
ja: ブラウザと検索
ko: 브라우저 및 찾기
zh_hans: 浏览器与查找
zh_hant: 瀏覽器與尋找

# shortcutDiscovery.section.navigation
source: Navigation
ar: التنقل
es: Navegación
ja: ナビゲーション
ko: 탐색
zh_hans: 导航
zh_hant: 導覽

# shortcutDiscovery.section.other
source: Other
ar: أخرى
de: Sonstiges
es: Otros
fr: Autre
ja: その他
ko: 기타
zh_hans: 其他
zh_hant: 其他

# shortcutDiscovery.section.panes
source: Panes
ar: الأجزاء
de: Teilfenster
es: Paneles
fr: Volets
ja: ペイン
ko: 분할 창
zh_hans: 窗格
zh_hant: 窗格

# shortcutDiscovery.section.workspace
source: Workspace
ar: مساحة العمل
de: Arbeitsbereich
es: Espacio de trabajo
fr: Espace de travail
ja: ワークスペース
ko: 작업 공간
zh_hans: 工作区
zh_hant: 工作區

# shortcutDiscovery.unassigned
source: Unassigned
ar: غير معين
de: Nicht zugewiesen
es: Sin asignar
fr: Non assigné
ja: 未割り当て
ko: 할당되지 않음
zh_hans: 未分配
zh_hant: 未分配

# sidebar.activeTabIndicator.leftRail
source: Left Rail
ar: العمود الأيسر
de: Linke Leiste
es: Riel izquierdo
fr: Rail gauche
ja: 左レール
ko: 왼쪽 레일
uk: Лівий рейл
zh_hans: 左侧竖条
zh_hant: 左側導軌

# sidebar.activeTabIndicator.solidFill
source: Solid Fill
ar: تعبئة بلون خالص
de: Vollfarbige Füllung
es: Relleno sólido
fr: Remplissage plein
ja: 塗りつぶし
ko: 단색 채우기
uk: Суцільне заповнення
zh_hans: 实心填充
zh_hant: 實心填滿

# sidebar.agentActivity.tooltip.many
source: Loading (%lld active tasks)
ar: جاري التحميل (%lld مهمة نشطة)
bs: Učitavanje (%lld aktivnih zadataka)
da: Indlæser (%lld aktive opgaver)
de: Laden (%lld aktive Aufgaben)
es: Cargando (%lld tareas activas)
fr: Chargement (%lld tâches actives)
it: Caricamento (%lld attività attive)
ja: 読み込み中（%lld件の実行中のタスク）
ko: 로드 중 (%lld개의 활성 작업)
nb: Laster (%lld aktive oppgaver)
pl: Ładowanie (%lld aktywnych zadań)
pt_br: Carregando (%lld tarefas ativas)
ru: Загрузка (%lld активных задач)
th: กำลังโหลด (งานที่ทำงานอยู่ %lld รายการ)
tr: Yükleniyor (%lld etkin görev)
uk: Завантаження (%lld активних завдань)
zh_hans: 正在加载 (%lld 个活动任务)
zh_hant: 載入中（%lld 個執行中的任務）

# sidebar.agentActivity.tooltip.one
source: Loading (1 active task)
ar: جارٍ التحميل (مهمة نشطة واحدة)
bs: Učitavanje (1 aktivan zadatak)
da: Indlæser (1 aktiv opgave)
de: Wird geladen (1 aktive Aufgabe)
es: Cargando (1 tarea activa)
fr: Chargement (1 tâche active)
it: Caricamento (1 attività attiva)
ja: 読み込み中（アクティブなタスク 1 件）
ko: 로딩 중(활성 작업 1개)
nb: Laster (1 aktiv oppgave)
pl: Ładowanie (1 aktywne zadanie)
pt_br: Carregando (1 tarefa ativa)
ru: Загрузка (1 активная задача)
th: กำลังโหลด (งานที่ทำงานอยู่ 1 รายการ)
tr: Yükleniyor (1 etkin görev)
uk: Завантаження (1 активне завдання)
zh_hans: 正在加载（1 个活跃任务）
zh_hant: 正在載入（1 個作用中任務）

# sidebar.browserStack.closeGroup
source: Close group
ar: إغلاق المجموعة
de: Gruppe schließen
es: Cerrar grupo
fr: Fermer le groupe
ja: グループを閉じる
ko: 그룹 닫기
zh_hans: 关闭分组
zh_hant: 關閉群組

# sidebar.browserStack.newTab
source: New Tab
ar: علامة تبويب جديدة
de: Neuer Tab
es: Nueva pestaña
fr: Nouvel onglet
ja: 新しいタブ
ko: 새 탭
zh_hans: 新建标签页
zh_hant: 新增標籤頁

# sidebar.checklist.addItem
source: Add item
ar: إضافة عنصر
de: Eintrag hinzufügen
es: Añadir elemento
fr: Ajouter un élément
ja: 項目を追加
ko: 항목 추가
zh_hans: 添加项目
zh_hant: 新增項目

# sidebar.checklist.addItemPlaceholder
source: New checklist item
ar: عنصر قائمة التحقق الجديد
de: Neuer Checklistenpunkt
es: Nuevo elemento de la lista de verificación
fr: Nouvel élément de la liste de contrôle
ja: 新しいチェックリスト項目
ko: 새로운 체크리스트 항목
zh_hans: 新建清单项
zh_hant: 新清單項目

# sidebar.checklist.attachImages
source: Attach Images…
ar: إرفاق صور…
de: Bilder anhängen…
es: Adjuntar imágenes…
fr: Joindre des images…
ja: 画像を添付…
ko: 이미지 첨부…
zh_hans: 附加图片…
zh_hant: 附加圖片…

# sidebar.checklist.attachImages.confirm
source: Attach
ar: إرفاق
de: Anhängen
es: Adjuntar
fr: Joindre
ja: 添付
ko: 첨부
zh_hans: 附加
zh_hant: 附加

# sidebar.checklist.attachmentUnavailable
source: File unavailable
ar: الملف غير متوفر
de: Datei nicht verfügbar
es: Archivo no disponible
fr: Fichier indisponible
ja: ファイルを利用できません
ko: 파일 사용 불가
zh_hans: 文件不可用
zh_hant: 無法取得檔案

# sidebar.checklist.attachments.noneAccessibility
source: No images attached. Attach images.
ar: لم يتم إرفاق أي صور. إرفاق صور.
de: Keine Bilder angehängt. Bilder anhängen.
es: No hay imágenes adjuntas. Adjuntar imágenes.
fr: Aucune image jointe. Joindre des images.
ja: 添付画像はありません。画像を添付してください。
ko: 첨부된 이미지가 없습니다. 이미지를 첨부하세요.
zh_hans: 未附加图片。附加图片。
zh_hant: 未附加任何圖片。請附加圖片。

# sidebar.checklist.attachments.one
source: 1 image attached
ar: تم إرفاق صورة واحدة
de: 1 Bild angehängt
es: 1 imagen adjunta
fr: 1 image jointe
ja: 1件の画像が添付されています
ko: 이미지 1개 첨부됨
zh_hans: 已附加 1 张图片
zh_hant: 已附加 1 張圖片

# sidebar.checklist.attachments.other
source: %lld images attached
ar: %lld صورة مرفقة
de: %lld Bilder angehängt
es: %lld imágenes adjuntas
fr: %lld images jointes
ja: %lld枚の画像が添付されています
ko: %lld개의 이미지 첨부됨
zh_hans: 已附加 %lld 张图片
zh_hant: 已附加 %lld 張圖片

# sidebar.checklist.attachmentsTooltip
source: Manage images
ar: إدارة الصور
de: Bilder verwalten
es: Gestionar imágenes
fr: Gérer les images
ja: 画像を管理
ko: 이미지 관리
zh_hans: 管理图片
zh_hant: 管理圖片

# sidebar.checklist.checkTooltip
source: Mark as completed
ar: وضع علامة كمكتمل
de: Als abgeschlossen markieren
es: Marcar como completado
fr: Marquer comme terminé
ja: 完了にする
ko: 완료로 표시
zh_hans: 标记为已完成
zh_hant: 標記為已完成

# sidebar.checklist.collapseTooltip
source: Hide checklist items
ar: إخفاء عناصر قائمة التحقق
de: Checklisten-Einträge ausblenden
es: Ocultar elementos de la lista de verificación
fr: Masquer les éléments de la liste
ja: チェックリスト項目を隠す
ko: 체크리스트 항목 숨기기
zh_hans: 隐藏清单项
zh_hant: 隱藏核取清單項目

# sidebar.checklist.editItem
source: Edit
ar: يحرر
de: Bearbeiten
es: Editar
fr: Modifier
ja: 編集
ko: 편집하다
zh_hans: 编辑
zh_hant: 編輯

# sidebar.checklist.editItemPlaceholder
source: Item text
ar: نص العنصر
de: Artikeltext
es: Texto del artículo
fr: Texte de l'article
ja: 項目のテキスト
ko: 아이템 텍스트
zh_hans: 项目文本
zh_hant: 項目文字

# sidebar.checklist.expandTooltip
source: Show checklist items
ar: إظهار عناصر قائمة التحقق
de: Checklisten-Einträge anzeigen
es: Mostrar elementos de la lista de verificación
fr: Afficher les éléments de la liste
ja: チェックリスト項目を表示
ko: 체크리스트 항목 표시
zh_hans: 显示清单项
zh_hant: 顯示核取清單項目

# sidebar.checklist.markInProgress
source: Mark In Progress
ar: تعيين كقيد التنفيذ
de: Als 'In Bearbeitung' markieren
es: Marcar en progreso
fr: Marquer comme en cours
ja: 進行中にする
ko: 진행 중으로 표시
zh_hans: 标记为进行中
zh_hant: 標記為進行中

# sidebar.checklist.moreItems
source: … %lld more
ar: … %lld عنصر آخر
de: … %lld mehr
es: … %lld más
fr: … %lld de plus
ja: … 他%lld件
ko: … %lld개 더
zh_hans: … 还有 %lld 项
zh_hant: … 還有 %lld 項

# sidebar.checklist.openAsPane
source: Open as Pane
ar: فتح كجزء
de: Als Teilfenster öffnen
es: Abrir como panel
fr: Ouvrir en tant que volet
ja: ペインとして開く
ko: 분할 창으로 열기
zh_hans: 以窗格打开
zh_hant: 在窗格中開啟

# sidebar.checklist.openAttachment
source: Open
ar: فتح
de: Offen
es: Abierto
fr: Ouvrir
ja: 開く
ko: 열려 있는
zh_hans: 打开
zh_hant: 打開

# sidebar.checklist.popoverTooltip
source: Show checklist
ar: إظهار قائمة التحقق
de: Checkliste anzeigen
es: Mostrar lista de verificación
fr: Afficher la liste
ja: チェックリストを表示
ko: 체크리스트 표시
zh_hans: 显示清单
zh_hant: 顯示核取清單

# sidebar.checklist.removeAttachment
source: Remove Attachment
ar: إزالة المرفق
de: Anhang entfernen
es: Eliminar archivo adjunto
fr: Supprimer la pièce jointe
ja: 添付を削除
ko: 첨부파일 제거
zh_hans: 移除附件
zh_hant: 刪除附件

# sidebar.checklist.removeItem
source: Remove
ar: إزالة
de: Entfernen
es: Eliminar
fr: Supprimer
ja: 削除
ko: 제거
zh_hans: 移除
zh_hant: 移除

# sidebar.checklist.removeItemTooltip
source: Remove item
ar: إزالة العنصر
de: Eintrag entfernen
es: Eliminar elemento
fr: Supprimer l’élément
ja: 項目を削除
ko: 항목 제거
zh_hans: 移除项目
zh_hant: 移除項目

# sidebar.checklist.uncheckTooltip
source: Mark as pending
ar: وضع علامة على أنه معلق
de: Als ausstehend markieren
es: Marcar como pendiente
fr: Marquer comme en attente
ja: 未完了にする
ko: 보류 중으로 표시
zh_hans: 标记为待办
zh_hant: 標記為待處理

# sidebar.closeWorkspace.tooltip
source: Close Workspace
ar: إغلاق مساحة العمل
bs: Zatvori radni prostor
da: Luk arbejdsområde
de: Arbeitsbereich schließen
es: Cerrar espacio de trabajo
fr: Fermer l'espace de travail
it: Chiudi area di lavoro
ja: ワークスペースを閉じる
ko: 작업 공간 닫기
nb: Lukk arbeidsområde
pl: Zamknij przestrzeń roboczą
pt_br: Fechar Área de Trabalho
ru: Закрыть рабочее пространство
th: ปิดเวิร์กสเปซ
tr: Çalışma Alanını Kapat
uk: Закрити робочу область
zh_hans: 关闭工作区
zh_hant: 關閉工作區

# sidebar.custom.error
source: Sidebar error
ar: خطأ في الشريط الجانبي
de: Seitenleisten-Fehler
es: Error de la barra lateral
fr: Erreur de la barre latérale
ja: サイドバーエラー
ko: 사이드바 오류
zh_hans: 侧边栏错误
zh_hant: 側邊欄錯誤

# sidebar.custom.missing
source: Sidebar file is empty or missing.
ar: ملف الشريط الجانبي فارغ أو مفقود.
de: Seitenleisten-Datei ist leer oder fehlt.
es: El archivo de la barra lateral está vacío o falta.
fr: Le fichier de la barre latérale est vide ou manquant.
ja: サイドバーファイルが空、または見つかりません。
ko: 사이드바 파일이 비어 있거나 누락되었습니다.
zh_hans: 侧边栏文件为空或缺失。
zh_hant: 側邊欄檔案為空或遺失。

# sidebar.custom.noView
source: No supported SwiftUI view found.
ar: لم يتم العثور على عرض SwiftUI مدعوم.
de: Keine unterstützte SwiftUI-Ansicht gefunden.
es: No se encontró ninguna vista de SwiftUI compatible.
fr: Aucune vue SwiftUI prise en charge n’a été trouvée.
ja: 対応している SwiftUI ビューが見つかりません。
ko: 지원되는 SwiftUI 뷰를 찾을 수 없습니다.
zh_hans: 未找到受支持的 SwiftUI 视图。
zh_hant: 找不到支援的 SwiftUI 檢視。

# sidebar.custom.validation.decodeFailed
source: Failed to decode sidebar JSON.
ar: فشل فك ترميز ملف JSON الخاص بالشريط الجانبي.
de: Seitenleisten-JSON konnte nicht decodiert werden.
es: Error al decodificar el JSON de la barra lateral.
fr: Échec du décodage du JSON de la barre latérale.
ja: サイドバー JSON のデコードに失敗しました。
ko: 사이드바 JSON을 디코딩하지 못했습니다.
zh_hans: 无法解码侧边栏 JSON。
zh_hant: 無法解碼側邊欄 JSON。

# sidebar.custom.validation.fileMissing
source: Sidebar file is missing.
ar: ملف الشريط الجانبي مفقود.
de: Seitenleisten-Datei fehlt.
es: Falta el archivo de la barra lateral.
fr: Le fichier de la barre latérale est manquant.
ja: サイドバーファイルが見つかりません。
ko: 사이드바 파일이 누락되었습니다.
zh_hans: 侧边栏文件缺失。
zh_hant: 遺失側邊欄檔案。

# sidebar.custom.validation.invalidJSON
source: Invalid JSON at %@
ar: ملف JSON غير صالح في %@
de: Ungültiges JSON bei %@
es: JSON no válido en %@
fr: JSON non valide à l'emplacement %@
ja: %@ の JSON が無効です
ko: %@에 잘못된 JSON이 있습니다
zh_hans: %@ 处的 JSON 无效
zh_hant: 在 %@ 的 JSON 無效

# sidebar.custom.validation.missingKey
source: Missing key '%@' at %@
ar: مفتاح مفقود '%@' في %@
de: Fehlender Schlüssel '%@' bei %@
es: Falta la clave '%@' en %@
fr: Clé '%@' manquante à l'emplacement %@
ja: キー '%@' が見つかりません（場所: %@）
ko: '%@' 키가 %@에서 누락되었습니다
zh_hans: 缺少键 '%@'，位置：%@
zh_hant: 遺失鍵值 '%@'，位於 %@

# sidebar.custom.validation.missingValue
source: Missing value at %@
ar: قيمة مفقودة في %@
de: Fehlender Wert bei %@
es: Falta el valor en %@
fr: Valeur manquante à l'emplacement %@
ja: %@ に値がありません
ko: %@에 값이 누락되었습니다
zh_hans: %@ 处缺少值
zh_hant: 在 %@ 遺失值

# sidebar.custom.validation.readFailed
source: Failed to read sidebar file.
ar: فشل قراءة ملف الشريط الجانبي.
de: Seitenleisten-Datei konnte nicht gelesen werden.
es: Error al leer el archivo de la barra lateral.
fr: Échec de la lecture du fichier de la barre latérale.
ja: サイドバーファイルの読み込みに失敗しました。
ko: 사이드바 파일을 읽지 못했습니다.
zh_hans: 无法读取侧边栏文件。
zh_hant: 無法讀取側邊欄檔案。

# sidebar.custom.validation.rootPath
source: root
ar: الجذر
es: raíz
fr: racine
ja: ルート
ko: 루트
zh_hans: 根
zh_hant: 根

# sidebar.custom.validation.typeMismatch
source: Type mismatch at %@
ar: عدم تطابق النوع في %@
de: Typenkonflikt bei %@
es: Incompatibilidad de tipo en %@
fr: Incompatibilité de type à l'emplacement %@
ja: %@ の型が一致しません
ko: %@에서 타입이 일치하지 않습니다
zh_hans: %@ 处类型不匹配
zh_hant: 在 %@ 類型不符

# sidebar.extension.browserAddress
source: Search or enter URL
ar: ابحث أو أدخل عنوان URL
de: Suchen oder URL eingeben
es: Buscar o introducir URL
fr: Rechercher ou saisir une URL
ja: 検索またはURLを入力
ko: 검색 또는 URL 입력
zh_hans: 搜索或输入 URL
zh_hant: 搜尋或輸入網址

# sidebar.extension.browserTab
source: Browser
ar: المتصفح
es: Navegador
fr: Navigateur
ja: ブラウザ
ko: 브라우저
zh_hans: 浏览器
zh_hant: 瀏覽器

# sidebar.extension.createWorktree
source: Create worktree
ar: إنشاء شجرة عمل
de: Worktree erstellen
es: Crear árbol de trabajo
fr: Créer un worktree
ja: ワークツリーを作成
ko: 작업 트리 생성
zh_hans: 创建 worktree
zh_hant: 建立 worktree

# sidebar.extension.inspectWorkspace
source: Workspace tools
ar: أدوات مساحة العمل
de: Arbeitsbereichs-Tools
es: Herramientas del espacio de trabajo
fr: Outils d’espace de travail
ja: ワークスペースツール
ko: 작업 공간 도구
zh_hans: 工作区工具
zh_hant: 工作區工具

# sidebar.extension.notesTab
source: Notes
ar: ملاحظات
de: Notizen
es: Notas
ja: メモ
ko: 메모
zh_hans: 备注
zh_hant: 筆記

# sidebar.extension.openWindow
source: Open window
ar: فتح نافذة
de: Fenster öffnen
es: Abrir ventana
fr: Ouvrir la fenêtre
ja: ウィンドウで開く
ko: 창 열기
zh_hans: 打开窗口
zh_hant: 開啟視窗

# sidebar.extension.toggleSection
source: Toggle section
ar: تبديل القسم
de: Bereich umschalten
es: Alternar sección
fr: Basculer la section
ja: セクションを切り替え
ko: 섹션 전환
zh_hans: 切换分区
zh_hant: 切換區段

# sidebar.extensions.access.detail
source: %@ is using metadata-only access until you grant its requested data and actions.
ar: يستخدم %@ وصولاً للبيانات الوصفية فقط حتى تمنحه حق الوصول إلى البيانات والإجراءات المطلوبة.
de: %@ verwendet Zugriff nur für Metadaten, bis Sie die angeforderten Daten und Aktionen freigeben.
es: %@ está usando acceso solo a metadatos hasta que concedas los datos y acciones solicitados.
fr: %@ utilise un accès uniquement aux métadonnées jusqu'à ce que vous lui accordiez l'accès aux données et aux actions demandées.
ja: 要求されたデータと操作を許可するまで、%@ はメタデータのみのアクセスを使用します。
ko: 요청된 데이터 및 작업 권한을 허용할 때까지 %@은(는) 메타데이터 전용 액세스를 사용합니다.
zh_hans: 在你授予所请求的数据和操作权限之前，%@ 仅使用元数据访问权限。
zh_hant: %@ 在您授予其請求的資料與動作前，將僅能存取中介資料。

# sidebar.extensions.access.grant
source: Grant Requested Access
ar: منح حق الوصول المطلوب
de: Angeforderten Zugriff gewähren
es: Conceder acceso solicitado
fr: Accorder l’accès demandé
ja: 要求されたアクセスを許可
ko: 요청된 액세스 허용
zh_hans: 授予请求的权限
zh_hant: 授予請求的存取權限

# sidebar.extensions.access.keepLimited
source: Keep Limited
ar: الإبقاء على الوصول محدودًا
de: Eingeschränkt lassen
es: Mantener limitado
fr: Conserver limité
ja: 制限したままにする
ko: 제한된 상태 유지
zh_hans: 保持受限
zh_hant: 保持限制

# sidebar.extensions.access.statusLimited
source: Limited
ar: محدود
de: Eingeschränkt
es: Limitado
fr: Limité
ja: 制限中
ko: 제한됨
zh_hans: 受限
zh_hant: 受限

# sidebar.extensions.access.statusLimited.help
source: This extension has limited access.
ar: هذا الامتداد لديه وصول محدود.
de: Diese Erweiterung hat eingeschränkten Zugriff.
es: Esta extensión tiene acceso limitado.
fr: Cette extension dispose d’un accès limité.
ja: この拡張機能のアクセスは制限されています。
ko: 이 확장은 액세스가 제한되어 있습니다.
zh_hans: 此扩展的访问权限受限。
zh_hant: 此擴充功能存取權限受限。

# sidebar.extensions.access.title
source: Limited extension access
ar: وصول محدود للامتداد
de: Eingeschränkter Erweiterungszugriff
es: Acceso limitado de la extensión
fr: Accès limité de l’extension
ja: 制限付き拡張機能アクセス
ko: 제한된 확장 액세스
zh_hans: 扩展访问权限受限
zh_hant: 擴充功能存取受限

# sidebar.extensions.action.closeRejected
source: Workspace could not be closed
ar: تعذر إغلاق مساحة العمل
de: Arbeitsbereich konnte nicht geschlossen werden
es: No se pudo cerrar el espacio de trabajo
fr: L’espace de travail n’a pas pu être fermé
ja: ワークスペースを閉じられませんでした
ko: 작업 공간을 닫을 수 없습니다
zh_hans: 无法关闭工作区
zh_hant: 無法關閉工作區

# sidebar.extensions.action.remoteTmuxWindowRequested
source: Remote tmux window requested
ar: تم طلب نافذة tmux عن بعد
de: Entferntes tmux-Fenster angefordert
es: Ventana remota de tmux solicitada
fr: Fenêtre tmux distante demandée
ja: リモート tmux ウィンドウを要求しました
ko: 원격 tmux 창이 요청되었습니다
zh_hans: 已请求远程 tmux 窗口
zh_hant: 已請求遠端 tmux 視窗

# sidebar.extensions.action.scopeRejected
source: Extension action is not granted
ar: لم يتم منح إجراء الامتداد
de: Erweiterungsaktion ist nicht gewährt
es: No se ha concedido la acción de la extensión
fr: L’action d’extension n’est pas autorisée
ja: 拡張機能の操作は許可されていません
ko: 확장 프로그램 작업 권한이 허용되지 않았습니다
zh_hans: 未授予该扩展操作权限
zh_hant: 未授予擴充功能動作權限

# sidebar.extensions.action.staleConnection
source: Extension connection is no longer active
ar: لم يعد اتصال الامتداد نشطًا
de: Erweiterungsverbindung ist nicht mehr aktiv
es: La conexión de la extensión ya no está activa
fr: La connexion de l’extension n’est plus active
ja: 拡張機能の接続はもう有効ではありません
ko: 확장 프로그램 연결이 더 이상 활성화되어 있지 않습니다
zh_hans: 扩展连接已失效
zh_hant: 擴充功能連線已失效

# sidebar.extensions.action.surfaceCreateRejected
source: Surface could not be created
ar: تعذر إنشاء السطح
de: Oberfläche konnte nicht erstellt werden
es: No se pudo crear la superficie
fr: La surface d’affichage n’a pas pu être créée
ja: サーフェスを作成できませんでした
ko: 화면을 생성할 수 없습니다
zh_hans: 无法创建表面
zh_hant: 無法建立介面

# sidebar.extensions.action.surfaceNotFound
source: Surface not found
ar: السطح غير موجود
de: Oberfläche nicht gefunden
es: Superficie no encontrada
fr: Surface d’affichage introuvable
ja: サーフェスが見つかりません
ko: 화면을 찾을 수 없습니다
zh_hans: 未找到表面
zh_hant: 找不到介面
